Model architecture evaluated at 2025-04-28 14:12:21.654611: 
 ----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1              [-1, 2, 8, 8]              18
         MaxPool2d-2              [-1, 2, 4, 4]               0
            Conv2d-3              [-1, 2, 5, 5]              18
         MaxPool2d-4              [-1, 2, 2, 2]               0
            Conv2d-5              [-1, 2, 3, 3]              18
         MaxPool2d-6              [-1, 2, 1, 1]               0
            Conv2d-7              [-1, 2, 2, 2]              18
         MaxPool2d-8              [-1, 2, 1, 1]               0
            Conv2d-9              [-1, 2, 2, 2]              18
        MaxPool2d-10              [-1, 2, 1, 1]               0
           Conv2d-11              [-1, 2, 2, 2]              18
        MaxPool2d-12              [-1, 2, 1, 1]               0
           Conv2d-13              [-1, 2, 2, 2]              18
        MaxPool2d-14              [-1, 2, 1, 1]               0
AdaptiveAvgPool2d-15            [-1, 2, 16, 16]               0
          Flatten-16                  [-1, 512]               0
           Linear-17                   [-1, 16]           8,208
           Linear-18                   [-1, 64]           1,088
             ReLU-19                   [-1, 64]               0
           Linear-20                    [-1, 8]             520
================================================================
Total params: 9,942
Trainable params: 9,942
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 0.01
Params size (MB): 0.04
Estimated Total Size (MB): 0.05
----------------------------------------------------------------
>Experiment parameters at 2025-04-28 14:12:21.654611
--------------------------------------------------
Environment  : RepeaterNetwork 
n            : 7 
directed     : False 
geometry     : chain 
kappa        : 1 
tau          : 100000 
p_entangle   : 0.85 
p_swap       : 0.85 
lr           : 0.001 
gamma        : 0.9 
epsilon      : 0.1 
criterion    : MSELossoptimizer    : Adam 
